var tanya = {
    "00:22.91": "到底要笑的多虚伪",
    "00:25.58": "才能够融入这世界",
    "00:28.29": "每个人的脸上",
    "00:30.20": "都像是贴了张一样的假面",
    "00:33.80": "想不起我在做什么",
    "00:36.45": "想不起我在想什么",
    "00:39.15": "想不起灵魂深处",
    "00:41.23": "到底发生了什么",
    "00:44.03": "迷雾迷雾在迷雾",
    "00:46.47": "我惊觉自己在原地踏步",
    "00:48.91": "到底是谁把我心蒙住",
    "00:52.00": "不想再糊涂",
    "00:54.96": "迷路迷路迷了路",
    "00:57.32": "我就彻底被这团迷雾困住",
    "01:00.02": "谁能够指引我一条路",
    "01:02.94": "带我走向正途",
    "01:17.48": "装不出融入的态度",
    "01:20.08": "空气里充斥着虚无",
    "01:22.78": "说什么都掩饰不了",
    "01:25.22": "我这局外人的局促",
    "01:28.12": "想不通自己怎么了",
    "01:30.87": "想不通世界怎么了",
    "01:33.72": "想不通心灵深处",
    "01:35.68": "到底变成什么了",
    "01:38.38": "迷雾迷雾在迷雾",
    "01:40.91": "我惊觉自己在原地踏步",
    "01:43.54": "到底是谁把我心蒙住",
    "01:46.36": "不想再糊涂",
    "01:49.41": "迷路迷路迷了路",
    "01:51.77": "我就彻底被这团迷雾困住",
    "01:54.56": "谁能够指引我一条路",
    "01:57.27": "走向正途",
    "02:00.33": "掌声 若需要掌声",
    "02:04.74": "只要你愿当被驯服的象",
    "02:08.25": "这舞台你就可以上",
    "02:11.25": "荣耀 胜过被嘲笑",
    "02:15.81": "所以抛开自尊",
    "02:19.39": "要紧牙根硬撑",
    "02:22.18": "迷雾迷雾在迷雾",
    "02:24.60": "我惊觉自己在原地踏步",
    "02:27.11": "到底是谁把我心蒙住",
    "02:30.23": "不想再糊涂",
    "02:33.00": "迷路迷路迷了路",
    "02:35.42": "我就彻底被这团迷雾困住",
    "02:38.15": "谁能够指引我一条路",
    "02:40.98": "带我走向正途",
    "02:44.17": "迷路迷路迷了路",
    "02:46.42": "我就彻底被这团迷雾困住",
    "02:49.05": "谁能够指引我一条路",
    "02:51.99": "带我走向正途",
    "02:57.79": "在迷雾 在迷雾  在迷雾",
    "03:03.34": "迷了路 迷了路 迷了路"
}
var keys = Object.keys(tanya)
var hmAndGeCi = {}
console.log('keys',keys)
for (var i = 0; i < keys.length; i++) {
  var a = keys[i].split(':')
  var t1 = Number(a[0]) * 60 * 1000
  var t2 = Number(a[1]) * 1000
  var res = t1 + t2
  hmAndGeCi[res] = tanya[keys[i]]
  console.log('re', res)
}
console.log(hmAndGeCi)
