
var tanya = {
    "00:22.91": "到底要笑的多虚伪",
    "00:25.58": "才能够融入这世界",
    "00:28.29": "每个人的脸上",
    "00:30.20": "都像是贴了张一样的假面",
    "00:33.80": "想不起我在做什么",
    "00:36.45": "想不起我在想什么",
    "00:39.15": "想不起灵魂深处",
    "00:41.23": "到底发生了什么",
    "00:44.03": "迷雾迷雾在迷雾",
    "00:46.47": "我惊觉自己在原地踏步",
    "00:48.91": "到底是谁把我心蒙住",
    "00:52.00": "不想再糊涂",
    "00:54.96": "迷路迷路迷了路",
    "00:57.32": "我就彻底被这团迷雾困住",
    "01:00.02": "谁能够指引我一条路",
    "01:02.94": "带我走向正途",
    "01:17.48": "装不出融入的态度",
    "01:20.08": "空气里充斥着虚无",
    "01:22.78": "说什么都掩饰不了",
    "01:25.22": "我这局外人的局促",
    "01:28.12": "想不通自己怎么了",
    "01:30.87": "想不通世界怎么了",
    "01:33.72": "想不通心灵深处",
    "01:35.68": "到底变成什么了",
    "01:38.38": "迷雾迷雾在迷雾",
    "01:40.91": "我惊觉自己在原地踏步",
    "01:43.54": "到底是谁把我心蒙住",
    "01:46.36": "不想再糊涂",
    "01:49.41": "迷路迷路迷了路",
    "01:51.77": "我就彻底被这团迷雾困住",
    "01:54.56": "谁能够指引我一条路",
    "01:57.27": "走向正途",
    "02:00.33": "掌声 若需要掌声",
    "02:04.74": "只要你愿当被驯服的象",
    "02:08.25": "这舞台你就可以上",
    "02:11.25": "荣耀 胜过被嘲笑",
    "02:15.81": "所以抛开自尊",
    "02:19.39": "要紧牙根硬撑",
    "02:22.18": "迷雾迷雾在迷雾",
    "02:24.60": "我惊觉自己在原地踏步",
    "02:27.11": "到底是谁把我心蒙住",
    "02:30.23": "不想再糊涂",
    "02:33.00": "迷路迷路迷了路",
    "02:35.42": "我就彻底被这团迷雾困住",
    "02:38.15": "谁能够指引我一条路",
    "02:40.98": "带我走向正途",
    "02:44.17": "迷路迷路迷了路",
    "02:46.42": "我就彻底被这团迷雾困住",
    "02:49.05": "谁能够指引我一条路",
    "02:51.99": "带我走向正途",
    "02:57.79": "在迷雾 在迷雾  在迷雾",
    "03:03.34": "迷了路 迷了路 迷了路"
}
var suxing = {
   "00:25.33": "也许是累了",
   "00:27.04": "只剩下一点朦胧",
   "00:29.68": "世界放慢小时分钟",
   "00:33.80": "你已经睡了",
   "00:35.50": "样子可爱的笑容",
   "00:38.25": "有难以控制的心动",
   "00:42.47": "我在你耳边哼着那段小情歌",
   "00:46.82": "你翘着脚指头的每个小动作",
   "00:50.97": "每一次呼吸都是有话对你说",
   "00:55.02": "这一刻 you are my whole world",
   "00:59.29": "My girl my girl",
   "01:03.59": "我只对你把心事诉说",
   "01:07.50": "So stay with me and let it be my love",
   "01:19.35": "爱着爱着你就是我的夜空",
   "01:23.39": "带着带着夜晚我所有的美梦",
   "01:27.74": "愿为你把一切心事都放空",
   "01:32.14": "醒来看到我你会懂",
   "01:36.30": "爱着爱着你就是我的夜空",
   "01:40.47": "不想不想这样再一个人做梦",
   "01:44.82": "陪在你的身边如此的轻松",
   "01:49.48": "醒来看到我你会懂",
   "01:55.21": "也许是累了",
   "01:57.06": "只剩下一点朦胧",
   "01:59.71": "世界放慢小时分钟",
   "02:03.73": "你已经睡了",
   "02:05.53": "样子可爱的笑容",
   "02:08.03": "有难以控制的心动",
   "02:12.53": "我在你耳边哼着那段小情歌",
   "02:16.68": "你翘着脚指头的每个小动作",
   "02:20.99": "每一次呼吸都是有话对你说",
   "02:24.94": "这一刻 you are my whole world",
   "02:29.28": "My girl my girl",
   "02:33.56": "我只对你把心事诉说",
   "02:37.85": "So stay with me and let it be my love",
   "02:49.21": "爱着爱着你就是我的夜空",
   "02:53.38": "带着带着夜晚我所有的美梦",
   "02:57.74": "愿为你把一切心事都放空",
   "03:02.11": "醒来看到我你会懂",
   "03:06.26": "爱着爱着你就是我的夜空",
   "03:10.46": "不想不想这样再一个人做梦",
   "03:14.87": "陪在你的身边如此的轻松",
   "03:19.48": "醒来看到我你会懂",
   "03:23.63": "爱着爱着你就是我的夜空",
   "03:27.92": "带着带着夜晚我所有的美梦",
   "03:31.84": "愿为你把一切心事都放空",
   "03:36.34": "醒来看到我你会懂",
   "03:40.50": "爱着爱着你就是我的夜空",
   "03:44.84": "不想不想这样再一个人做梦",
   "03:49.19": "陪在你的身边如此的轻松",
   "03:53.79": "醒来看到我你会懂"
}
// var jolin = {}
// var jingwen = {}
// var kara = {}
// var yayan = {}
// var lrcArray = [tanya, suxing, jolin, jingwen, kara, yayan]

var lrcObject = {
  '蔡健雅 - 被驯服的象.mp3' : tanya,
  '苏醒 - 晚安亲爱的.mp3' : suxing,
  '蔡依林 - 小伤口.mp3' : '',
  'Kara - 不懂不懂.mp3' : '',
  '白雅言 - 爱情学概论.mp3' : '',
}
// 一个由lrcObject的value组成的对象 [tanya, suxing]
var lrcObjectValues = Object.values(lrcObject)
  // console.log('lrcObjectValues', lrcObjectValues);
  var lrcObjectKeys = Object.keys(lrcObject)
    // console.log('lrcObjectValues', lrcObjectValues);


var hmAndGeCiObject = {}
for (var i = 0; i < lrcObjectValues.length; i++) {
  var lrc = lrcObjectValues[i]
  // lrc为一个包含歌词的对象
  // console.log('lrc', lrc);
  // 通过 Object.keys方法得到歌词的更新时间组成的数组
  var key = Object.keys(lrc)
  // console.log('key',key)
  var hmAndGeCi = {}
 // 循环遍历key，将其转化为ms时间格式
  for (var j = 0; j < key.length; j++) {
    // 03:53.79 --- [03, 53.79],用split将字符串分为数组a
    var a = key[j].split(':')
    var t1 = Number(a[0]) * 60 * 1000
    var t2 = Number(a[1]) * 1000
    var res = t1 + t2
    // console.log('res', res)
   // 将歌词赋值于对应的时间，得到一个新的歌词对象
    hmAndGeCi[res] = lrc[key[j]]
  }
  // console.log("hmAndGeCi", hmAndGeCi)
  hmAndGeCiObject[lrcObjectKeys[i]] = hmAndGeCi
}
 // console.log('hmAndGeCiObject', hmAndGeCiObject);



 // var yy = {}
 // for (var i = 1; i < d.length; i++) {
 //   var f = d[i]
 //   var k = f.slice(0, 8)
 //   var v = f.slice(9)
 //   yy[k] = v
 // }
 // var yystring = JSON.stringify(yy, null, 4)
